---
kind: other
id: Methods.T:Autodesk.Revit.DB.SketchedStairsCurveData
source: html/da1f1140-4569-93ba-7576-eafb31bcab96.htm
---
# SketchedStairsCurveData Methods

Get a copy of the curve that is formed along this boundary.